Catalogs/Outlet.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Outlet</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Address</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Class</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OutletClass</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClosingCause</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ClosingCause</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Distributor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Distributor</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Comment>Используется проверка введенных данных, согласно выражению "/^([A-za-z0-9_-]+\.)*[A-za-z0-9_-]+@[A-za-z0-9_-]+(\.[A-za-z0-9_-]+)*\.[A-za-z]{2,6}$/". Обязателен символ @, допускаются заглавные и строчные латинские буквы, цифры и подчеркивания</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>INN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KPP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Lattitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Longitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutletStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OutletStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OwnershipType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OwnershipType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PhoneNumber</Name>
					<Comment>Используется проверка введенных данных, согласно выражению "/^((8|\+7)[\- ]?)?(\(?\d{3,4}\)?[\- ]?)?[\d\- ]{5,10}$/". Допускаются цифры, скобки, тире, комбинация "+7". Длинна кода 3-4 символа, длина номера 5-10 символов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReceivableLimit</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OutletType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WebSite</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Contacts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ContactName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Position</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PhoneNumber</Name>
							<Comment>Используется проверка введенных данных, согласно выражению "/^((8|\+7)[\- ]?)?(\(?\d{3,4}\)?[\- ]?)?[\d\- ]{5,10}$/". Допускаются цифры, скобки, тире, комбинация "+7". Длинна кода 3-4 символа, длина номера 5-10 символов</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Comment>Используется проверка введенных данных, согласно выражению "/^([A-za-z0-9_-]+\.)*[A-za-z0-9_-]+@[A-za-z0-9_-]+(\.[A-za-z0-9_-]+)*\.[A-za-z]{2,6}$/". Обязателен символ @, допускаются заглавные и строчные латинские буквы, цифры и подчеркивания</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotActual</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Parameters</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Parameter</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.OutletParameter</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Prices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PriceList</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.PriceList</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Snapshots</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>FileName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Deleted</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContactPersons</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ContactPerson</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NotActual</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ContractorsList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Contractor</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Contractors</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Default</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Outlet/Forms/OutletsOnMapForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	Maps.AddMap(ThisForm, Items.GroupMap, , Constants.DefaultCity.Get());
	Scheme=Catalogs.Outlet.GetTemplate("MainDataCompositionSchema");
	Settings=Scheme.DefaultSettings;
	SettingComp = New DataCompositionSettingsComposer;
	SchemeOr=PutToTempStorage(Scheme,New UUID());
	SettingComp.Initialize(New DataCompositionAvailableSettingsSource(SchemeOr));
	SettingComp.LoadSettings(Settings);

EndProcedure

&AtClient
Procedure Show(Command)
	
	Maps.ClearMarkers(ThisForm);
	
	Markers = ShowServer();
	
	For Each Element In Markers Do
		
		Maps.AddMarker(ThisForm, Element);
		
	EndDo;
	
	If Markers.Count() > 0 Then
		
		Maps.SetMapCenter(ThisForm, Markers[0]);
		
	EndIf;
	
EndProcedure

&AtServer
Function ShowServer()
	
	Scheme=Catalogs.Outlet.GetTemplate("MainDataCompositionSchema");
	Settings=SettingComp.GetSettings();
	Composer = New DataCompositionTemplateComposer();
	Template = Composer.Execute(Scheme, Settings, , , Type("DataCompositionValueCollectionTemplateGenerator"));
	
	Processor = New DataCompositionProcessor;
	Processor.Initialize(Template);
	OutputProcessor = New DataCompositionResultValueCollectionOutputProcessor; // DataCompositionResultValueCollectionOutputProcessor;
	VT = New ValueTable;
	OutputProcessor.SetObject(VT);
	
	Result = OutputProcessor.Output(Processor);
	Result.GroupBy("Lattitude,Longitude,Ref");	
	Array = New Array;
	
	For Each Row In Result Do
		
		If Not (Row.Lattitude = 0 And Row.Longitude = 0) Then
			
			Coordinates = Maps.GetCoordinates(Row.Lattitude, Row.Longitude);
			Coordinates.Insert("Description", "<center><b>Торговая точка: </b>" + Row.Ref.Description + "</center>");
			Coordinates.Insert("FullInfo", "<p><b>Наименование: </b><a href='' class='outlet' id='" + Row.Ref.UUID() + "'>" + Row.Ref.Description + "</a></p><p><b>Адрес: </b>" + Row.Ref.Address + "</p><p><b>Тип: </b>" + Row.Ref.Type + "</p><p><b>Класс: </b>" + Row.Ref.Class + "</p>");
			Array.Add(Coordinates);
			
		EndIf;
		
	EndDo;
	
	Return Array;
	
EndFunction

&AtClient
Procedure OnMapClick(Item, EventData, StandardProcessing)
	
	IsOutlet = EventData.Element.className = "outlet";
	StandardProcessing = Not IsOutlet;
	
	If IsOutlet Then
		
		ShowValue(,GetOutletRef(EventData.Element.Id));
		
	EndIf;
	
EndProcedure

&AtServerNoContext
Function GetOutletRef(UUID)
	
	Return Catalogs.Outlet.GetRef(New UUID(UUID));
	
EndFunction
